Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t
Serialization structure for building hierarchy site.

Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t.id
Field for site id.

Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t.aGuid
The guid of the building hierarchy site.

Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t.aName
Name of the building hierarchy site.

Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t.OperationType
Defines if this is a create, read, update, or delete operation.
Tekla.Structures.ModelInternal.dotObjectOperationsEnum

Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t.aDescription
The description of the building hierarchy site.